#include <iostream>
using namespace std;

/*
 * Программа: О себе
 * Автор: [Ваше имя]
 * Дата: [Текущая дата]
 * Группа: [Ваша группа]
 */

int main() {
    system("chcp 65001>nul");
    // Заголовок
    cout << "================================" << endl;
    cout << "       Информация о студенте    " << endl;
    cout << "================================" << endl;

    // Личные данные
    cout << endl;
    cout << "Имя: Руслан" <<endl;
    cout << "Группа: ИСПкр-252" << endl;
    cout << "Возраст: 19" << endl;

    // Увлечения
    cout << endl;
    cout << "Мои увлечения:" << endl;
    cout << "  1. Компьютерные игры" << endl;
    cout << "  2. Фильмы" << endl;
    cout << "  3. Общение с друзьями" << endl;

    // Мотивация
    cout <<endl;
    cout << "Почему я изучаю программирование:" << endl;
    cout << "Для получения полезного навыка" << endl;

    cout << endl;
    cout << "================================" << endl;

    return 0;
} 